test1_google = '༡༥༤ («གཡུང་»«ལི་»«པེ་»«སྣར་«ཅོ་»«ཞོལ་»བྱུང༌། «སྣར་»«ཞོལ་»ལྷས་བྱིན། ཉི«ཅོ་»གར།\n©«གཡུང་»ལོ། «གཡུང་»«པེ་»གཅིག © «པེ་»+ལ། ༧ «སྣར་«ཞོལ་»རོ། «གཡུང་»སྨྲས།\n«པེ་»སྨྲས།'
test1_namsel = '༡༥༤ ①«གཡུང་»«ལི་»«པེ་»«སྣར་»«ཅོ་»«ཞོལ་»བྱུང་། ②«སྣར་»«ཞོལ་»ལྷས་བྱིན། ①«ཅོ་»གར། ④«གཡུང་»བོ།\n⑤«གཡུང་»«བེ་»གཅིག ་ ༠«བེ་»་ལ། ⑦«སྣར་»«ཞོལ་»རོ། ⑧«གཡུང་»མས། «པེ་»སྨྲས།'
test1_truth = '༡༥༤ <1,①>«གཡུང་»«ལི་»«པེ་»«སྣར་«ཅོ་»«ཞོལ་»བྱུང༌། <2,②>«སྣར་»«ཞོལ་»ལྷས་བྱིན། <1,①>«ཅོ་»གར།\n <4,④>«གཡུང་»ལོ། <5,⑤>«གཡུང་»«པེ་»གཅིག <0,༠>«པེ་»+ལ། <7,⑦>«སྣར་«ཞོལ་»རོ། <8,⑧>«གཡུང་»སྨྲས།\n«པེ་»སྨྲས།'
