# coding=utf-8
from pathlib import Path
import re

content = '''
<r༣>བསྡུརམཆན 
<1,①>མཚན་བྱང་འདི་ཆོས་ཚན་འདིའི་མཚན་བོད་སྐད་དུ་སྨོས་པ་ལྟར་བཀོད། 
<2,②>«y»«j»«q»«n»«c»«h»-པ། 
<1,①>«y»«j»«q»«c»ཤིག {པོད་འདིའི་ནང་དུ་ཚིག་ཕྲད་ཅིག་ཞིག་ཤིག་གསུམ་རྣམས་དཔེ་ཁག་འགའ་རེར་བརྡ་སྤྲོད་ཀྱི་འགྲོས་དང་མི་མཐུན་པར་གོ་རིམ་ངེས་མེད་དུ་འབྱུང་བ་དང་།_ཡང་སྐབས་འགར་«d»ལ་གོ་ལྡོག་སྟེ་གཅིག་གྱུར་མིན་པས་འདིར་གསལ་བཤད་ཀྱིས་འཐུས་པར་བྱས་ཏེ་གཤམ་དུ་བསྡུར་མཆན་དུ་བཀོད་མེད།}
<1,①>«y»«q»འཐོམ་ཞིང་། «j»མཐོམ་ཞིང་། «n»ཐོམས་ཞིང་། «c»མཐོམས་ཞིང་།
<5,⑤>«y»«q»དེའི། 
<6,⑥>«y»«q»«n»«c»«h»རྣམས།
<7,⑦>«h»ཀྱི།
<8,⑧>«y»«q»ཅང་།
<9,⑨>«y»«q»འོ།
<10,⑩>«y»«q»ཅུང་།
<4,4>«y»«q»འཚན།
<8,⑧>«q»དེ།
<r༤>
<1,①>«y»བཞི་གཉན། 
<2,②>«y»+ང་། «q»ནབ། 
<10,⑩>«j»«q»+ཆུང་།
<4,④>«y»«q»དགུར།
<0,⓪>«y»«q»ལས།
<6,⑥>«y»«q»ཁྱིའུ། {པོད་འདིའི་ནང་དུ་ཁྱེའུ་གཟུགས་བཟང་དང་བྲམ་ཟེ་ཁྱེའུ་སོགས་ཀྱི་ཁྱེའུ་ཞེས་པ་རྣམས་«y»«q»ལ་ཁྱིའུ་ཞེས་འཁོད་ཀྱང་གཤམ་དུ་བསྡུར་མཆན་དུ་བཀོད་མེད།}
<4,④>«j»«n»«c»ལྟ།
<8,⑧>«y»པྲལ། «q»བྲལ།
<6,⑥>«y»«q»ཆེས་པ། 
<10,⑩>«n»«h»མཐུན། {པོད་འདིའི་ནང་དུ་རིགས་དང་འཐུན་དང་མི་འཐུན་སོགས་ཀྱི་འཐུན་ཞེས་པ་རྣམས་«n»«c»«h»ལ་མཐུན་དང་«y»«j»«q»ལ་སྐབས་འགར་མཐུན་ཞེས་འཁོད་ཀྱང་གཤམ་དུ་བསྡུར་མཆན་དུ་བཀོད་མེད།}
<0,⓪>«y»མི་བརྟགས། «q»མི་མིང་བཏགས།
<9,⑨>«y»སྙིང་ཀུས་སྐྱེད། «j»«n»སྙིང་གུས་བསྐྱེད། «q»སྙིང་གུས་སྐྱེད། «c»«h»སྙིང་ཁུས་བསྐྱེད།
<13,⑬>«y»«q»པས།
<4,④>«y»གཞུག་པའི་ཕས་ཁྱེ། «q»གཞུགས་པའི་ཕྱིར་ཕས་ཁྱེ། 
<10,⑩>«n»«h»འང་། {པོད་འདིའི་ནང་དུ་དེ་ཡང་དང་འདི་ཡང་སོགས་ཀྱི་ཡང་ཞེས་པ་རྣམས་«n»«h»ལ་འང་ཞེས་འཁོད་ཀྱང་གཤམ་དུ་བསྡུར་མཆན་དུ་བཀོད་མེད།}
<0,⓪>«y»«q»རྒྱུགས།
<10,⑩>«y»བསྔགས།
<9,⑨>«y»འཇུག 
<67,༦༧>«j»«q»«n»«c»སྐོར་བར། «h»བསྐོར་བར།
<0,⓪>«n»བཞག 
<r༥>
<1,①>«y»«q»བསམས།
<2,②>«y»«q»སྙོམ། 
<1,①>«y»སྐྲོགས། «h»སྒྲོག 
<4,④>«y»«j»«q»«n»«c»པ་ནི།
<5,⑤>«y»«j»«q»«n»«c»«h»འཕོངས། «u»ཉམས།
<7,⑦>«y»«j»«q»«n»«c»འགྱུར།
<8,⑧>«y»«j»«q»«n»«c»«h»འཕོངས།
<6,⑥>«y»«j»«q»«n»«c»བཞག 
<10,⑩>«u»-པ།
<10,⑩>«y»ཕགས།
<10,⑩>«y»«q»སྐྱེད།
<4,4>«y»«j»«q»«n»«c»«h»-རྣམས། 
<7,⑦>«y»བསླབས།«q»བརླབས།
<r༦>
<1,①>«y»ཤཱའིའི། «q»ཤཱ་རའི། 
<2,②>«y»«q»-ནས། 
<8,⑧>«c»གིས། 
<4,④>«y»«q»«n»«c»«h»བསྐོར་བར། «j»སྐོར་བར།
<5,⑤>«h»བསམ། {པོད་འདིའི་ནང་དུ་བསམས་པ་དང་བསམས་ཏེ་སོགས་ཀྱི་བསམས་ཞེས་པ་རྣམས་«h»ལ་བསམ་ཞེས་དང་«y»«q»«u»ལ་སྐབས་འགར་བསམ་ཞེས་འཁོད་ཀྱང་གཤམ་དུ་བསྡུར་མཆན་དུ་བཀོད་མེད།}
<6,⑥>«c»བསྟི།
<7,⑦>«y»«q»དག
<8,⑧>«n»«h»བཙལ། {པོད་འདིའི་ནང་དུ་ཕྱག་འཚལ་ཞེས་པ་རྣམས་«n»«h»ལ་ཕྱག་བཙལ་ཞེས་འཁོད་ཀྱང་གཤམ་དུ་བསྡུར་མཆན་དུ་བཀོད་མེད།}
<r༧>
<7,⑦>«q»+ལ།
<2,②>«y»«q»བསྟན།
<2,②>«y»བདུག 
<4,④>«y»«q»སྟབས།
<5,⑤>«c»གྱུར།
<6,⑥>«u»དཀྲུས།
<7,⑦>«y»«j»«q»«n»«c»དེའི།
<8,⑧>«y»«q»ཏོ།
<9,⑨>«y»«q»+པ།
<4,4>«y»«j»«q»«n»«c»«h»པར།
<0,⓪>«y»«q»བསྟན།
<0,⓪>«y»-དག 
<10,⑩>«y»«q»-དང་།
<r༨>'''

marker = '<r'
list = re.split(marker, content)

for i, e in enumerate(list, 2):
    print(f'{i}-{marker}{e}')